Tekla.Structures.Geometry3d.GeometryConstants
The Constants class of Geometry3d holds certain constant values that are used
internally by the other geometry classes.

Tekla.Structures.Geometry3d.GeometryConstants.DISTANCE_EPSILON
The minimum distance used for checking if points, lines, etc. coincide.
Anything smaller will be considered equivalent to 0.0.

Tekla.Structures.Geometry3d.GeometryConstants.ANGULAR_EPSILON
The minimum angle (radians) used for checking angular parallelism, perpendicularity, etc.
Anything smaller will be considered equivalent to 0.0.

Tekla.Structures.Geometry3d.GeometryConstants.SCALAR_EPSILON
The minimum value used for comparing floating point scalar values. Any smaller difference will be considered
equivalent to 0.0.